a = 1     # int
b = 'x'   # str
c = False # bool
d = []    # list
e = {}    # dict
f = ()    # tuple
g = set() # set    =>  מכיל רק ערכים ייחודיים

###################################

my_list = [1, 2, 3, 4] # ליסט לדוגמא

# דיקשינרי לדוגמא
person = {
    'name': 'chaim',
    'age': 25,
    'address': {
        'city': 'emanuel',
        'street': 'rabi meir',
        'hom number': 34
    }
}

# לולאה פשוטה לדוגמא
for i in range(len(my_list)):
    print(my_list[i])

# משימות
# 1. יצירת ליסט
# 2. הדפס את תוכן הליסט ללא הסוגריים
# 3. הדפס את תוכן הליסט ע"י לולאת while
# 4. הדפס את תוכן הלולאה ע"י לולאת FOR עם RANG ובלי RANGE 
# 
# 5. צור דיקשינרי של בית עם כתובת, גודל הבית במטרים רבועים, וכמות אנשים שגרים בבית
# 6. הדפס את הכתובת בלבד מתוך הדיקשנרי
# 7. הדפס את מספר האנשים בלבד מתוך הדיקשנרי
# 6. הדפס את כמות האנשים בלבד מתוך הדיקשנרי
#
# 8. החלף את הכתובת מכתובת מלאה לכתובת כדיקשינרי
# 9. תדפיס את מספר הבית בלבד

# בהצלחה!